Pandas数据结构

In [1]:
# 数据分析三剑客
import numpy as np

import pandas as pd
from pandas import Series,DataFrame


# 绘图，可视化
import matplotlib.pyplot as plt

In [2]:
pd.__version__

'1.0.1'

1.Series
Series组成部分：
values：一组数据（ndarray类型）
index:相关的数据索引标签

In [3]:
# 第一种创建方法
s = Series(data = np.random.randint(0,150,size = 10),index = list('abcdefhijk'),name = 'python')
s

a     17
b     10
c     62
d     16
e      9
f     15
h     34
i     71
j    124
k    103
Name: python, dtype: int32

In [4]:
# 由字典创建
s2 = Series({'A':144,'B':137,'C':125,'D':99})
s2

A    144
B    137
C    125
D     99
dtype: int64

In [5]:
type(s)

pandas.core.series.Series

2.Series的索引与切片

In [6]:
s['d']

16

In [7]:
# 显式索引
s[['d','e','e']]

d    16
e     9
e     9
Name: python, dtype: int32

In [9]:
#(2)隐式索引：两种，推荐使用.iloc[]

In [10]:
# 隐式索引
s[0]

17

In [11]:
s

a     17
b     10
c     62
d     16
e      9
f     15
h     34
i     71
j    124
k    103
Name: python, dtype: int32

In [12]:
s[-1]

103

In [13]:
s.iloc[0]

17

In [14]:
s.loc['a']

17

切片

In [15]:
s['a':'f']

a    17
b    10
c    62
d    16
e     9
f    15
Name: python, dtype: int32

In [16]:
s['a':'w']

a     17
b     10
c     62
d     16
e      9
f     15
h     34
i     71
j    124
k    103
Name: python, dtype: int32

In [17]:
s['a':'abrf']

a    17
Name: python, dtype: int32

In [18]:
s['a':'brf']

a    17
b    10
Name: python, dtype: int32

In [19]:
s[::2]

a     17
c     62
e      9
h     34
j    124
Name: python, dtype: int32

In [35]:
s.loc['a':'b']

a    92
b     6
Name: python, dtype: int32

In [36]:
s.loc[::-2]

k     74
i     60
f      7
d    112
b      6
Name: python, dtype: int32

In [37]:
s.iloc[0:3]

a     92
b      6
c    140
Name: python, dtype: int32

In [38]:
s.iloc[::3]

a     92
d    112
h     12
k     74
Name: python, dtype: int32

3) Series基本概念

In [39]:
s.shape

(10,)

In [40]:
s.size

10

In [41]:
s.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'h', 'i', 'j', 'k'], dtype='object')

In [42]:
# Series中的值是ndarray
s.values

array([ 92,   6, 140, 112,  61,   7,  12,  60, 140,  74])

In [44]:
s.head()

a     92
b      6
c    140
d    112
e     61
Name: python, dtype: int32

In [45]:
s.tail()

f      7
h     12
i     60
j    140
k     74
Name: python, dtype: int32

In [46]:
# NaN (not a number)
s[['d','i']] = np.NaN
s

a     92.0
b      6.0
c    140.0
d      NaN
e     61.0
f      7.0
h     12.0
i      NaN
j    140.0
k     74.0
Name: python, dtype: float64

In [47]:
# 查找空数据
s.isnull()

a    False
b    False
c    False
d     True
e    False
f    False
h    False
i     True
j    False
k    False
Name: python, dtype: bool

In [48]:
cond = s.isnull()
s[cond]

d   NaN
i   NaN
Name: python, dtype: float64

In [50]:
# 筛选非空数据
cond = s.notnull()
s[cond]

a     92.0
b      6.0
c    140.0
e     61.0
f      7.0
h     12.0
j    140.0
k     74.0
Name: python, dtype: float64

In [51]:
s2

A    144
B    137
C    125
D     99
dtype: int64

In [54]:
s2.name = 'Math'
s2

A    144
B    137
C    125
D     99
Name: Math, dtype: int64

4) Series的运算

In [55]:
s

a     92.0
b      6.0
c    140.0
d      NaN
e     61.0
f      7.0
h     12.0
i      NaN
j    140.0
k     74.0
Name: python, dtype: float64

In [56]:
s + 10

a    102.0
b     16.0
c    150.0
d      NaN
e     71.0
f     17.0
h     22.0
i      NaN
j    150.0
k     84.0
Name: python, dtype: float64

In [59]:
s3 = s.add(10,fill_value=0)
s3

a    102.0
b     16.0
c    150.0
d     10.0
e     71.0
f     17.0
h     22.0
i     10.0
j    150.0
k     84.0
Name: python, dtype: float64

In [60]:
s3.astype(np.int8)

a    102
b     16
c   -106
d     10
e     71
f     17
h     22
i     10
j   -106
k     84
Name: python, dtype: int8

In [ ]:
# 无符号的int8
s3.astype(np.int8)

In [61]:
s.mean()

66.5

In [62]:
# 中位数
s.median()

67.5

In [63]:
s.max()

140.0

In [64]:
s.min()

6.0

In [65]:
# 方差
s.std()

55.69303624075712

In [66]:
# 幂运算
s.pow(2)

a     8464.0
b       36.0
c    19600.0
d        NaN
e     3721.0
f       49.0
h      144.0
i        NaN
j    19600.0
k     5476.0
Name: python, dtype: float64

In [67]:
# 数值出现了多少次
s.value_counts()

140.0    2
74.0     1
12.0     1
7.0      1
61.0     1
6.0      1
92.0     1
Name: python, dtype: int64

In [ ]:
# 面试题

In [81]:
li = ['xxxx.mp3','ingfed.mp3','jieojf.wav','sfiui.als','ucyyd.ps','jiyd.als']

In [77]:
aaaaa = 'xxxx.mp3'
aaaaa.split('.')[-1]

'mp3'

In [90]:
# 尝试去掉[:2]看
def count_suffix(li):
    
    return Series([l.split('.')[-1] for l in li]).value_counts()[:2]

In [91]:
count_suffix(li)

als    2
mp3    2
dtype: int64

In [92]:
# s是一维的，转不转置是一样的
s.T

a     92.0
b      6.0
c    140.0
d      NaN
e     61.0
f      7.0
h     12.0
i      NaN
j    140.0
k     74.0
Name: python, dtype: float64

In [94]:
s2

A    144
B    137
C    125
D     99
Name: Math, dtype: int64

In [97]:
s3 = Series({'A':88,'B':124,'C':67})
s3

A     88
B    124
C     67
dtype: int64

In [98]:
s2 + s3

A    232.0
B    261.0
C    192.0
D      NaN
dtype: float64

In [99]:
99 + np.NaN

nan

In [100]:
s2.add(s3,fill_value=0)

A    232.0
B    261.0
C    192.0
D     99.0
dtype: float64

!!!!!DataFrame

In [2]:
#第一种创建方法：以字典的键为每一列的名称，以字典的值为每一列
df = DataFrame(data = {'Python':np.random.randint(0,150,size = 5),
                       'Math':np.random.randint(0,150,size = 5),
                       'En':np.random.randint(0,150,size = 5)},
               index = list('ABCDE'))
df

   Python  Math   En
A      10    37   90
B      25    50   72
C     101    45  124
D     130    69  114
E      84   127    6

In [4]:
#第二种方法
df2 = DataFrame(data = np.random.randint(0,150,size = (10,4)),
               index = list('ABCDEFHIJK'),
               columns=['Python','Math','En','Physic'])
df2

   Python  Math   En  Physic
A     146   110   23      33
B     124    11  138      23
C      22   114   85     118
D      62    59    6      42
E     132    88   33      48
F     144    97  138      76
H      55   108   31      36
I      57   101   24     141
J     111    83  141      17
K      49    80  149      77

In [5]:
#保存上面的数据
#csv 即txt格式
df2.to_csv('./data.txt')

In [29]:
df2.to_excel('./data.xlsx')

In [26]:
df3 = pd.read_csv('./data.txt' )
df3

  Unnamed: 0  Python  Math   En  Physic
0          A     113   108   89      49
1          B      62    12  119      57
2          C      26    35   81       5
3          D       4   104   22     134
4          E      90   125   15     112
5          F      38    46  106     122
6          H       1    18  123      87
7          I      31   101  113      75
8          J     130    88    7     148
9          K      46    90   54     134

In [10]:
# axis = 1  指列；mapper：映射
df3.rename({'Unnamed: 0':'index'},axis = 1)

  index  Python  Math   En  Physic
0     A     113   108   89      49
1     B      62    12  119      57
2     C      26    35   81       5
3     D       4   104   22     134
4     E      90   125   15     112
5     F      38    46  106     122
6     H       1    18  123      87
7     I      31   101  113      75
8     J     130    88    7     148
9     K      46    90   54     134

In [21]:
# 加载时可以选择index----index_col
df4 = df3.rename(mapper = {'Unnamed: 0':'index'},axis = 1)
df4.set_index(keys = 'index')

       Python  Math   En  Physic
index
A         113   108   89      49
B          62    12  119      57
C          26    35   81       5
D           4   104   22     134
E          90   125   15     112
F          38    46  106     122
H           1    18  123      87
I          31   101  113      75
J         130    88    7     148
K          46    90   54     134

In [28]:
#  ？？？此处视频中与上表一样，不知为何
pd.read_excel('./data.xlsx')

  Unnamed: 0  Python  Math   En  Physic
0          A     113   108   89      49
1          B      62    12  119      57
2          C      26    35   81       5
3          D       4   104   22     134
4          E      90   125   15     112
5          F      38    46  106     122
6          H       1    18  123      87
7          I      31   101  113      75
8          J     130    88    7     148
9          K      46    90   54     134

In [ ]:
#结构化的数据  sql   df是结构化数据
#半结构化的数据
#非结构化的数据

In [31]:
df

   Python  Math   En
A      10    37   90
B      25    50   72
C     101    45  124
D     130    69  114
E      84   127    6

In [32]:
df.values

array([[ 10,  37,  90],
       [ 25,  50,  72],
       [101,  45, 124],
       [130,  69, 114],
       [ 84, 127,   6]])

In [33]:
df.columns

Index(['Python', 'Math', 'En'], dtype='object')

In [34]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [35]:
df.shape

(5, 3)

In [36]:
df.dtypes

Python    int32
Math      int32
En        int32
dtype: object

索引

In [39]:
# 列索引
df2.Python

A    113
B     62
C     26
D      4
E     90
F     38
H      1
I     31
J    130
K     46
Name: Python, dtype: int32

In [40]:
df2.En

A     89
B    119
C     81
D     22
E     15
F    106
H    123
I    113
J      7
K     54
Name: En, dtype: int32

In [50]:
df2['Math']

A    108
B     12
C     35
D    104
E    125
F     46
H     18
I    101
J     88
K     90
Name: Math, dtype: int32

In [52]:
df2[['Math','En']]

   Math   En
A   108   89
B    12  119
C    35   81
D   104   22
E   125   15
F    46  106
H    18  123
I   101  113
J    88    7
K    90   54

In [54]:
# 行索引
df2.A

AttributeError: 'DataFrame' object has no attribute 'A'

In [67]:
df2.['A']

SyntaxError: invalid syntax (<ipython-input-67-9fac0acfce2e>, line 1)

In [59]:
df2.loc['A']

Python    113
Math      108
En         89
Physic     49
Name: A, dtype: int32

In [60]:
df2.loc[['A','C']]

   Python  Math  En  Physic
A     113   108  89      49
C      26    35  81       5

In [61]:
df2.iloc[[3,5]]

   Python  Math   En  Physic
D       4   104   22     134
F      38    46  106     122

In [63]:
#对元素索引
df2['Math']['C']

35

In [68]:
df2.loc['C']['Python']

26

In [69]:
df2.loc['B','En']

119

In [71]:
# 先是行后是列;下面错误
df2.['En','B']

SyntaxError: invalid syntax (<ipython-input-71-51446f338d42>, line 2)

切片

In [74]:
df2['Python':'En']

Empty DataFrame
Columns: [Python, Math, En, Physic]
Index: []

In [75]:
# 直接使用[]，是对行进行切片
df2['A':'F']

   Python  Math   En  Physic
A     113   108   89      49
B      62    12  119      57
C      26    35   81       5
D       4   104   22     134
E      90   125   15     112
F      38    46  106     122

In [76]:
df2.loc['A':'F']

   Python  Math   En  Physic
A     113   108   89      49
B      62    12  119      57
C      26    35   81       5
D       4   104   22     134
E      90   125   15     112
F      38    46  106     122

In [77]:
df2.iloc[0:5]

   Python  Math   En  Physic
A     113   108   89      49
B      62    12  119      57
C      26    35   81       5
D       4   104   22     134
E      90   125   15     112

In [78]:
# 列切片需求比较少，列是属性
df2.iloc[:,1:3]

   Math   En
A   108   89
B    12  119
C    35   81
D   104   22
E   125   15
F    46  106
H    18  123
I   101  113
J    88    7
K    90   54

DataFrame的运算

In [79]:
df2+10

   Python  Math   En  Physic
A     123   118   99      59
B      72    22  129      67
C      36    45   91      15
D      14   114   32     144
E     100   135   25     122
F      48    56  116     132
H      11    28  133      97
I      41   111  123      85
J     140    98   17     158
K      56   100   64     144

In [81]:
# 保留两位小数
df2.divide(3).round(2)

   Python   Math     En  Physic
A   37.67  36.00  29.67   16.33
B   20.67   4.00  39.67   19.00
C    8.67  11.67  27.00    1.67
D    1.33  34.67   7.33   44.67
E   30.00  41.67   5.00   37.33
F   12.67  15.33  35.33   40.67
H    0.33   6.00  41.00   29.00
I   10.33  33.67  37.67   25.00
J   43.33  29.33   2.33   49.33
K   15.33  30.00  18.00   44.67

![](xiefangcha.jpg)

In [82]:
# 协方差
df2.cov()

             Python         Math           En       Physic
Python  1950.988889   741.144444  -823.544444   259.411111
Math     741.144444  1678.455556 -1220.144444   757.988889
En      -823.544444 -1220.144444  2034.100000 -1192.188889
Physic   259.411111   757.988889 -1192.188889  2102.233333

In [5]:
# 皮尔逊相关系数
df2.corr()

          Python      Math        En    Physic
Python  1.000000 -0.216862  0.151378 -0.544607
Math   -0.216862  1.000000 -0.338753  0.443967
En      0.151378 -0.338753  1.000000 -0.102633
Physic -0.544607  0.443967 -0.102633  1.000000

In [6]:
df2.any()

Python    True
Math      True
En        True
Physic    True
dtype: bool

In [7]:
df2.all()

Python    True
Math      True
En        True
Physic    True
dtype: bool

In [8]:
# 方差
df2.var()

Python    2090.622222
Math       953.877778
En        3511.511111
Physic    1716.544444
dtype: float64

In [10]:
df2['Physic'] = 105
df2

   Python  Math   En  Physic
A     146   110   23     105
B     124    11  138     105
C      22   114   85     105
D      62    59    6     105
E     132    88   33     105
F     144    97  138     105
H      55   108   31     105
I      57   101   24     105
J     111    83  141     105
K      49    80  149     105

In [11]:
df2.var()

Python    2090.622222
Math       953.877778
En        3511.511111
Physic       0.000000
dtype: float64

In [15]:
df2.iloc[3,3] = None
df2

   Python  Math   En  Physic
A     146   110   23   105.0
B     124    11  138   105.0
C      22   114   85   105.0
D      62    59    6     NaN
E     132    88   33   105.0
F     144    97  138   105.0
H      55   108   31   105.0
I      57   101   24   105.0
J     111    83  141   105.0
K      49    80  149   105.0

In [16]:
df2.shape

(10, 4)

In [14]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, A to K
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Python  10 non-null     int32
 1   Math    10 non-null     int32
 2   En      10 non-null     int32
 3   Physic  9 non-null      float64
dtypes: float64(1), int32(3)
memory usage: 280.0+ bytes

In [17]:
df2.describe()

           Python        Math          En  Physic
count   10.000000   10.000000   10.000000     9.0
mean    90.200000   85.100000   76.800000   105.0
std     45.723323   30.884912   59.258005     0.0
min     22.000000   11.000000    6.000000   105.0
25%     55.500000   80.750000   25.750000   105.0
50%     86.500000   92.500000   59.000000   105.0
75%    130.000000  106.250000  138.000000   105.0
max    146.000000  114.000000  149.000000   105.0

DataFrame之间的运算

In [18]:
df1 = DataFrame(np.random.randint(0,150,size = (5,3)),index = list('ABCDE'),columns=['Python','Math','En'])
df1

   Python  Math   En
A      42   118   99
B     111    19   84
C      50    99  145
D      15    90   97
E     133   100  139

In [20]:
df2 = DataFrame(np.random.randint(0,150,size = (6,3)),index = list('ABCDEF'),columns=['Python','Math','En'])
df2

   Python  Math   En
A      12    71    7
B      72    38   39
C      20    25   93
D       8    79   11
E     146   125  105
F     117   146   14

In [21]:
df1 + df2

   Python   Math     En
A    54.0  189.0  106.0
B   183.0   57.0  123.0
C    70.0  124.0  238.0
D    23.0  169.0  108.0
E   279.0  225.0  244.0
F     NaN    NaN    NaN

In [24]:
df3 = df1.add(df2,fill_value=0)
df3

   Python   Math     En
A    54.0  189.0  106.0
B   183.0   57.0  123.0
C    70.0  124.0  238.0
D    23.0  169.0  108.0
E   279.0  225.0  244.0
F   117.0  146.0   14.0

In [26]:
df3.loc['A':'E']/2

   Python   Math     En
A    27.0   94.5   53.0
B    91.5   28.5   61.5
C    35.0   62.0  119.0
D    11.5   84.5   54.0
E   139.5  112.5  122.0

In [28]:
df3.loc['A':'E']=df3.loc['A':'E']/2
df3

   Python    Math     En
A   13.50   47.25  26.50
B   45.75   14.25  30.75
C   17.50   31.00  59.50
D    5.75   42.25  27.00
E   69.75   56.25  61.00
F  117.00  146.00  14.00

Series与DataFrame之间的运算

In [39]:
df1

   Python  Math   En
A      42   118   99
B     111    19   84
C      50    99  145
D      15    90   97
E     133   100  139

In [30]:
s1 = df1.loc['A']
s1

Python     42
Math      118
En         99
Name: A, dtype: int32

In [31]:
# 符合广播机制
df1.add(s1)

   Python  Math   En
A      84   236  198
B     153   137  183
C      92   217  244
D      57   208  196
E     175   218  238

In [ ]:
# axis : {0 or 'index', 1 or 'columns'}

In [38]:
s2 = df1.Python
s2

A     42
B    111
C     50
D     15
E    133
Name: Python, dtype: int32

In [33]:
df1.add(s2,axis = 'columns')

    A   B   C   D   E  En  Math  Python
A NaN NaN NaN NaN NaN NaN   NaN     NaN
B NaN NaN NaN NaN NaN NaN   NaN     NaN
C NaN NaN NaN NaN NaN NaN   NaN     NaN
D NaN NaN NaN NaN NaN NaN   NaN     NaN
E NaN NaN NaN NaN NaN NaN   NaN     NaN

In [40]:
df1.add(s2,axis = 'index')

   Python  Math   En
A      84   160  141
B     222   130  195
C     100   149  195
D      30   105  112
E     266   233  272